{
  "project": "NowThenNext",
  "branchName": "ralph/phonics-card-images",
  "description": "Phonics Card Images - add illustrations for example words with tap-to-flip interaction on phonics flashcards",
  "userStories": [
    {
      "id": "US-065",
      "title": "Add ImagePath field to GraphemeCard model",
      "description": "As a developer, I need the data model to support an image path per phonics card so illustrations can be wired up.",
      "acceptanceCriteria": [
        "Add ImagePath property (string, nullable) to GraphemeCard in Models/PhonicsModels.cs",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Simple model change. Add 'public string? ImagePath { get; set; }' to the GraphemeCard class."
    },
    {
      "id": "US-066",
      "title": "Add tap-to-flip interaction on PhonicsCard page",
      "description": "As a user, I want to tap a phonics card to flip between the grapheme view and an image of the example word so I can build visual associations.",
      "acceptanceCriteria": [
        "Tapping the card area (grapheme + word section) flips to show the image + word",
        "Tapping again flips back to the grapheme view",
        "Flip uses a gentle CSS transition (~0.4s, matching learning cards style)",
        "The example word remains visible on both sides",
        "If no image is set (ImagePath is null), tapping does nothing and card does not flip",
        "The Got it! button, previous/next arrows, and back button are NOT part of the flippable area",
        "Flip state resets when navigating to a different card (in OnParametersSetAsync)",
        "Uses phonics colour theme (calm-phonics #7BA3C4)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Add a bool ShowImage toggle in PhonicsCard.razor.cs. The card body area gets an @onclick handler. When ShowImage is true, render an <img src='@CurrentCard.ImagePath'> instead of the grapheme/hint. The example word with highlighted grapheme stays visible on both sides. Reset ShowImage = false at the start of OnParametersSetAsync. Only enable click when CurrentCard?.ImagePath is not null."
    },
    {
      "id": "US-067",
      "title": "Add Phase 2 phonics images and wire up paths",
      "description": "As a developer, I need to add illustration PNGs for all concrete Phase 2 example words and set their ImagePath in PhonicsDataService.",
      "acceptanceCriteria": [
        "PNG files added to wwwroot/images/phonics/ for Phase 2 cards with concrete example words, named by card ID (e.g. p2-w1-s.png)",
        "Each image clearly represents the example word (sun, ant, tap, pin, etc.)",
        "Cards with abstract/hard-to-illustrate words (e.g. it, on, up, got, yes) are skipped — no ImagePath set, card does not flip",
        "All illustrated Phase 2 cards in PhonicsDataService.cs have ImagePath set to images/phonics/{id}.png",
        "Images render correctly when tapping a Phase 2 card to flip",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Images must already exist in wwwroot/images/phonics/ before this story can be completed. The story wires up ImagePath values in PhonicsDataService.cs for Phase 2 BuildWeek calls. Abstract words to skip: 'it' (p2-w2-i), 'got' (p2-w3-g), 'on' (p2-w3-o), 'up' (p2-w4-u), 'win' (p2-w7-w), 'yes' (p2-w7-y). Concrete words to include: sun, ant, tap, pin, net, mat, dog, cat, kid, duck, egg, red, hat, bat, fan, puff, leg, bell, hiss, van, fox, zip, buzz, queen, chip, shop, thin, ring, pink."
    },
    {
      "id": "US-068",
      "title": "Add Phase 3 phonics images and wire up paths",
      "description": "As a developer, I need to add illustration PNGs for all Phase 3 example words and set their ImagePath in PhonicsDataService.",
      "acceptanceCriteria": [
        "PNG files added to wwwroot/images/phonics/ for Phase 3 cards with concrete example words, named by card ID",
        "Each image clearly represents the example word (rain, feet, night, boat, moon, book, car, fork, nurse, cow, coin, dear, fair, letter)",
        "Cards with abstract words are skipped — no ImagePath set",
        "All illustrated Phase 3 cards in PhonicsDataService.cs have ImagePath set",
        "Images render correctly when tapping a Phase 3 card to flip",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Phase 3 has 14 cards and most example words are concrete. All should get images: rain, feet, night, boat, moon, book, car, fork, nurse, cow, coin, dear, fair, letter. Uses duplicate-grapheme pattern for oo_long/oo_short."
    },
    {
      "id": "US-069",
      "title": "Add Phase 4 phonics images and wire up paths",
      "description": "As a developer, I need to add illustration PNGs for Phase 4 cards with concrete example words and set their ImagePath in PhonicsDataService.",
      "acceptanceCriteria": [
        "PNG files added to wwwroot/images/phonics/ for Phase 4 cards with concrete example words, named by card ID",
        "Each image clearly represents the example word (crab, flag, frog, lamp, tent, sand, etc.)",
        "Cards with abstract words (e.g. bring, glad, grip, plan, press, self, best, kept, task, next) are skipped — no ImagePath set",
        "All illustrated Phase 4 cards in PhonicsDataService.cs have ImagePath set",
        "Images render correctly when tapping a Phase 4 card to flip",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Phase 4 has many abstract consonant-cluster words. Concrete words to include: black, clap, crab, drop, flag, frog, skip, slip, snap, spot, stop, swim, trip, twin, lamp, sand, pink, tent. Abstract words to skip: bring, glad, grip, plan, press, scam, smell, left, self, help, felt, kept, task, best, next."
    },
    {
      "id": "US-070",
      "title": "Add Phase 5 phonics images and wire up paths",
      "description": "As a developer, I need to add illustration PNGs for Phase 5 cards with concrete example words and set their ImagePath in PhonicsDataService.",
      "acceptanceCriteria": [
        "PNG files added to wwwroot/images/phonics/ for Phase 5 cards with concrete example words, named by card ID",
        "Each image clearly represents the example word (play, cloud, pie, toy, bird, cake, snow, etc.)",
        "Cards with abstract words (e.g. each, when, new, these, could, they, me, go) are skipped — no ImagePath set",
        "All illustrated Phase 5 cards in PhonicsDataService.cs have ImagePath set",
        "Images render correctly when tapping a Phase 5 card to flip",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Phase 5 has split digraphs and alternative pronunciations. Concrete words: play, cloud, pie, toy, bird, blue, saw, phone, toe, cake, time, home, tube, snow, cow, field, bread, shoulder, key, acorn, tiger, unicorn, fly, school, chef, write, knee, gnome, lamb. Abstract words to skip: each, when, new, these, could, they, me, go, happy, August, eat."
    },
    {
      "id": "US-071",
      "title": "E2E test for phonics card flip interaction",
      "description": "As a developer, I need E2E tests to verify the tap-to-flip interaction works correctly.",
      "acceptanceCriteria": [
        "Test: tapping a phonics card with an image flips to show the image",
        "Test: tapping again flips back to show the grapheme",
        "Test: navigating to next card resets flip state",
        "Test: Got it! button still works after flipping",
        "All tests pass",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Add tests to PhonicsTests.cs. Navigate to a Phase 2 card that has an image (e.g. /phonics/2/card/p2-w1-s which shows 'sun'). Test the flip toggle, then navigate to next card and verify flip resets. Use relative href selectors per CLAUDE.md."
    }
  ]
}
