{
  "project": "NowThenNext",
  "branchName": "ralph/storage-breakdown",
  "description": "Storage Breakdown - show all stored items with sizes and a usage progress bar on the Settings page",
  "userStories": [
    {
      "id": "US-049",
      "title": "Add method to calculate individual image item sizes",
      "description": "As a developer, I need a way to calculate the approximate storage size of each ImageItem so sizes can be displayed in the UI.",
      "acceptanceCriteria": [
        "Add a StorageItemInfo record/class with properties: Id (string), Label (string), Category (string), SizeBytes (long), ThumbnailData (string, nullable)",
        "Add a method GetStorageBreakdownAsync() to IImageStorageService that returns a list of StorageItemInfo for all images, plus entries for phonics-progress and learning-cards data",
        "Image item sizes are calculated by measuring UTF8 byte count of their serialised JSON (including base64 data and metadata)",
        "Phonics progress size is calculated from the raw JSON string returned by indexedDb.getItem('phonics-progress')",
        "Learning cards size is calculated from the raw JSON string returned by indexedDb.getItem('learning-cards')",
        "Non-image entries use Label 'Phonics Progress' and 'Learning Cards Data' with Category 'System'",
        "Entries with null or empty data are excluded from the list",
        "List is sorted by SizeBytes descending",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Add StorageItemInfo record to IImageStorageService.cs (near StorageInfo). Implement in LocalStorageImageService. For images, serialise each ImageItem individually with JsonSerializer.Serialize and measure with Encoding.UTF8.GetByteCount. For phonics/learning-cards, call _jsRuntime.InvokeAsync<string?>('indexedDb.getItem', storeName) and measure the string. Set ThumbnailData to the image's Base64Data for thumbnail rendering."
    },
    {
      "id": "US-050",
      "title": "Add storage usage progress bar to Settings page",
      "description": "As a parent/carer, I want to see a visual progress bar showing total storage usage so I know at a glance how much space is used.",
      "acceptanceCriteria": [
        "A 'Storage Usage' section appears on the Settings page below the Data Management section and above the Attribution",
        "Section has a heading 'Storage Usage' styled consistently with the existing 'Data Management' heading",
        "A horizontal progress bar shows current usage as a proportion of estimated browser quota",
        "Text below the bar shows 'X.X MB of Y.Y MB used (Z%)' using human-readable formatting",
        "Progress bar uses calm-primary (#5B9A9A) fill colour",
        "Progress bar switches to calm-amber (#D4A06A) fill when usage exceeds 80%",
        "When no data is stored, shows 'No data stored' with an empty progress bar at 0%",
        "The section is contained in a card matching the existing settings-container styling (white bg, rounded, shadow, max-width 32rem)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Use the existing GetStorageInfoAsync() for total usage and quota. Place the new section between the settings-container div and the attribution-section div. Format bytes: < 1024 = '< 1 KB', < 1MB = 'X.X KB', >= 1MB = 'X.X MB', >= 1GB = 'X.X GB'. The progress bar is a simple div-in-div with percentage width and rounded corners."
    },
    {
      "id": "US-051",
      "title": "Display sorted list of stored items with sizes",
      "description": "As a parent/carer, I want to see a list of everything stored in the app sorted by size so I understand what's using the most space.",
      "acceptanceCriteria": [
        "A scrollable list appears below the storage progress bar in the same card",
        "Each image entry shows: small thumbnail (~40px, rounded, object-fit cover), label (or 'Untitled' if empty), category badge (Places/Food/Activities with category colours), and formatted size",
        "Phonics progress entry shows a book icon (SVG), label 'Phonics Progress', a 'System' badge, and formatted size",
        "Learning cards entry shows a cards icon (SVG), label 'Learning Cards Data', a 'System' badge, and formatted size",
        "Items are sorted by size descending (largest first)",
        "List has a max-height with overflow-y scroll so it doesn't push the page layout (around 400px / ~6-8 items visible)",
        "Sizes formatted as: < 1024 bytes = '< 1 KB', < 1 MB = 'X.X KB', >= 1 MB = 'X.X MB'",
        "Category badge colours: Places = calm-primary (#5B9A9A), Food = calm-accent (#7BA893), Activities = calm-amber (#D4A06A), System = calm-text-light (#606F7B)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Call GetStorageBreakdownAsync() from US-049. Render each item as a flex row: thumbnail/icon on left, label + badge in centre, size on right. Use existing base64 data for image thumbnails via <img src='data:image/...;base64,...'>. For non-image items, use inline SVG icons. The list container should have a subtle top border to separate it from the progress bar section."
    },
    {
      "id": "US-052",
      "title": "Add loading state for storage breakdown",
      "description": "As a parent/carer, I want to see a loading indicator while storage data is being calculated so I know the app is working.",
      "acceptanceCriteria": [
        "A spinner or 'Calculating storage...' message displays in the storage section while data loads",
        "The storage section renders fully once calculation completes",
        "If calculation fails, a friendly message 'Unable to calculate storage usage' appears instead of a broken UI",
        "Loading state uses the same spinner style as the backup/restore buttons",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Add IsLoadingStorage bool and StorageError string fields. Set IsLoadingStorage = true in OnInitializedAsync, call GetStorageInfoAsync and GetStorageBreakdownAsync in a try/catch, set IsLoadingStorage = false when done. On error, set StorageError message. Use the same animate-spin SVG spinner from the existing backup button."
    },
    {
      "id": "US-053",
      "title": "E2E test for storage breakdown display",
      "description": "As a developer, I need E2E tests to verify the storage breakdown section renders correctly on the Settings page.",
      "acceptanceCriteria": [
        "Test: storage usage section is visible on Settings page with heading 'Storage Usage'",
        "Test: progress bar element exists within the storage section",
        "Test: when images are uploaded, they appear in the storage breakdown list with their label and size",
        "Test: items in the list are sorted by size descending (verify first item is largest)",
        "All tests pass",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Add tests to BackupRestoreTests.cs or create a new SettingsTests.cs file. Upload a test image first (reuse the upload helper pattern from existing tests), then navigate to /settings and verify the storage section. Use data-testid attributes if needed for reliable selectors."
    }
  ]
}
